package ru.musicunity.backend.service;

public class ReleaseService {
    // TODO добавить релиз (выбрать/добавить авторов, выбрать жанр)
    // TODO добавить свой релиз (выбрать/добавить авторов, выбрать жанр) -- для авторов
    // TODO список с сортировкой по дате (новые)
    // TODO список с поиском по автору групировка по типу релиза
    // TODO топ 5 релизов по автору(приоритет на средней оценке пользователей с полной рецензией)
    // TODO топ 15 релизов по кол-ву рецензий и оценок за сутки
    // TODO полная инфа о релизе
}